In [9]:
# http://kekefund.com/2016/06/17/pandas-groupby/

In [2]:
import numpy as np
import pandas as pd

In [4]:
df = pd.DataFrame({'key1':['a','a','b','b','a'],'key2':['one','two','one','two','one'],'data1':range(5),'data2':range(5)})
df

   data1  data2 key1 key2
0      0      0    a  one
1      1      1    a  two
2      2      2    b  one
3      3      3    b  two
4      4      4    a  one

# 1，Series为分组键
按key1分组，计算data1的平均值：

In [7]:
grouped = df['data1'].groupby(df['key1'])
grouped.mean()

key1
a    1.666667
b    2.500000
Name: data1, dtype: float64

In [8]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one     2
      two     1
b     one     2
      two     3
Name: data1, dtype: int64

In [10]:
means.unstack()

key2  one  two
key1
a       2    1
b       2    3

In [11]:
states = np.array(['Ohio', 'Clifornia', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
df['data1'].groupby([states, years]).mean()

California  2006    2.0
Clifornia   2005    1.0
Ohio        2005    1.5
            2006    4.0
Name: data1, dtype: float64

In [12]:
for i,k in grouped:
    print('i:',i)
    print('k:',k)

i: a
k: 0    0
1    1
4    4
Name: data1, dtype: int64
i: b
k: 2    2
3    3
Name: data1, dtype: int64

In [15]:
df.groupby('key1').mean()

         data1     data2
key1
a     1.666667  1.666667
b     2.500000  2.500000

In [17]:
df.groupby(['key1','key2']).sum()

           data1  data2
key1 key2
a    one       4      4
     two       1      1
b    one       2      2
     two       3      3